class Solution:
    def trap(self, height: list[int]) -> int:
        """
        left,rightでの挟み撃ちをする水槽の問題が過去あった。
        あれを、複数空間で実施する感じ？いや、違いそう。
        頂点を見つけて、頂点間で水槽を作っていく。
        0,1,0だったら、1が壁になる。
        0,1,1,0,2だったら、2つめの1と、2が壁になる。
        1,1,1,2,1,1,1だったら、何も貯まらない。
        下がった瞬間を開始ポイント、
        上がってから、（維持が続き）下がり始めたポイントがあったら、最後の上がったポイントを終了ポイント、
        として、
        criteria = min(height[開始ポイント], height[終了ポイント]) 
        water += sum((max(criteria, height[i]) for i in range(開始ポイント, 終了ポイント+1))
            
        """
